<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2016 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 流年 <liu21st@gmail.com>
// +----------------------------------------------------------------------

// 应用公共文件
// 获取地址栏的参数
function getUrlParams($params=[])
{
    //  删除循环变量
    foreach($params as $v)
    {
        unset($_GET[$v]);
    }
    $str = '';
    foreach($_GET as $k=>$v)
    {
        $str .= "$k={$v}&";
    }
    return $str;
}

